src/Documents/ЗаявкаОтПокупателя/ЗаявкаОтПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаОтПокупателя</name>
  <registerRecords>AccumulationRegister.ЗаявкиОтПокупателей</registerRecords>
  <attributes>
    <name>ДатаИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <comment>Текущий курс</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дополнение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Коэфф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/Цены/Цены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Цены</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаФактическая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ЗаявкаОтПокупателя/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Если ОбщийМодульВызовСервера.ДоступностьРоли("Снабжение") Тогда
	//СписокРазрешенныхРолей = Новый СписокЗначений;

	//СписокРазрешенныхРолей.Добавить("Администратор");
	//СписокРазрешенныхРолей.Добавить("Мастер");
	//СписокРазрешенныхРолей.Добавить("ГлавныйДиспетчер");
	//ЭтотОбъект.ТолькоПросмотр = ОбщийМодульСозданиеДокументов.ЗапретРедактирования(Объект.Ссылка,Ложь,Истина,СписокРазрешенныхРолей);
	Если (ОбщийМодульВызовСервера.ДоступностьРоли("СервисЦентр"))и(ОбщийМодульВызовСервера.ПолучитьСписокРолей().Количество() = 1) Тогда
	ЭтотОбъект.ТолькоПросмотр = ОбщийМодульСозданиеДокументов.ЗапретРедактирования(Объект.Ссылка,Истина,Ложь);
	Элементы.Подразделение.Доступность = Ложь;
	Элементы.Контрагент.Доступность = Ложь;
	Элементы.Договор.Доступность = Ложь;
	Элементы.ТабличнаяЧастьЦена.Доступность = Ложь;
	Элементы.ТабличнаяЧастьСумма.Доступность = Ложь;
	Элементы.ТабличнаяЧастьСтавкаНДС.Доступность = Ложь;
	Элементы.ТабличнаяЧастьНДС.Доступность = Ложь;
	Элементы.ТабличнаяЧастьВсего.Доступность = Ложь;
	Иначе
	ЭтотОбъект.ТолькоПросмотр = ОбщийМодульСозданиеДокументов.ЗапретРедактирования(Объект.Ссылка,Ложь,Истина);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьМПЗПриИзменении(Элемент)
ТабличнаяЧастьМПЗПриИзмененииНаСервере(Элементы.ТабличнаяЧасть.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ТабличнаяЧастьМПЗПриИзмененииНаСервере(Стр)
ТЧ = Объект.ТабличнаяЧасть.НайтиПоИдентификатору(Стр);
ТЧ.ЕдиницаИзмерения = ТЧ.МПЗ.ОсновнаяЕдиницаИзмерения;
	Если ТипЗнч(ТЧ.МПЗ) = Тип("СправочникСсылка.Материалы") Тогда
	ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;	
	Иначе
	ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;	
	КонецЕсли; 
Цены = РегистрыСведений.Цены.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("МПЗ",ТЧ.МПЗ));
ТЧ.Цена = Цены.Цена*ТЧ.ЕдиницаИзмерения.Коэффициент*Объект.Коэфф;
ТЧ.Сумма = ТЧ.Цена*ТЧ.Количество;
ТЧ.СтавкаНДС = Константы.ОсновнаяСтавкаНДС.Получить();
ТЧ.НДС = ТЧ.Сумма*ТЧ.СтавкаНДС.Ставка/100;
ТЧ.Всего = ТЧ.Сумма + ТЧ.НДС;
КонецПроцедуры

&НаСервере
Процедура ПодборМПЗНаСервере(ТаблицаМПЗ)
	Для каждого ТЧ_МПЗ Из ТаблицаМПЗ Цикл
	ТЧ = Объект.ТабличнаяЧасть.Добавить();
		Если ТипЗнч(ТЧ_МПЗ.МПЗ) = Тип("СправочникСсылка.Материалы") Тогда
		ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;		
		Иначе
		ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;	
		КонецЕсли; 
	ТЧ.МПЗ = ТЧ_МПЗ.МПЗ;
	ТЧ.Количество = ТЧ_МПЗ.Количество;
	ТЧ.ЕдиницаИзмерения = ТЧ_МПЗ.ЕдиницаИзмерения;
	Цены = РегистрыСведений.Цены.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("МПЗ",ТЧ_МПЗ.МПЗ));
	ТЧ.Цена = Цены.Цена*ТЧ_МПЗ.ЕдиницаИзмерения.Коэффициент*Объект.Коэфф;
	ТЧ.Сумма = ТЧ.Цена*ТЧ.Количество;
	ТЧ.СтавкаНДС = Константы.ОсновнаяСтавкаНДС.Получить();
	ТЧ.НДС = ТЧ.Сумма*ТЧ.СтавкаНДС.Ставка/100;
	ТЧ.Всего = ТЧ.Сумма + ТЧ.НДС;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ПодборМПЗ(Команда)
ТаблицаМПЗ = ОткрытьФормуМодально("ОбщаяФорма.ПодборМПЗ", Новый Структура("МестоХранения",Неопределено));
	Если ТаблицаМПЗ <> Неопределено Тогда
		Если ТаблицаМПЗ.Количество() > 0 Тогда
			Если Объект.ТабличнаяЧасть.Количество() > 0 Тогда
				Если Вопрос("Очистить таблицу?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				Объект.ТабличнаяЧасть.Очистить();		
				КонецЕсли; 			
			КонецЕсли; 
		ПодборМПЗНаСервере(ТаблицаМПЗ);
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПечатьЗаявкиНаСервере(ТабДок)
Макет = Документы.ЗаявкаОтПокупателя.ПолучитьМакет("Заявка");
ОблШапка1 = Макет.ПолучитьОбласть("Шапка1");
ОблДополнение = Макет.ПолучитьОбласть("Дополнение");	 
ОблШапка2 = Макет.ПолучитьОбласть("Шапка2");	
ОблСтрока = Макет.ПолучитьОбласть("Строка");
ОблИтогоСумма = Макет.ПолучитьОбласть("ИтогоСумма");
ОблИтогоНДС = Макет.ПолучитьОбласть("ИтогоНДС");
ОблИтогоНП = Макет.ПолучитьОбласть("ИтогоНП");
ОблИтогоВсего = Макет.ПолучитьОбласть("ИтогоВсего");
ОблПодвал = Макет.ПолучитьОбласть("Подвал");
ОблШапка1.Параметры.НазваниеОрганизации = Константы.НазваниеОрганизации.Получить();
АдресТелефон = СокрЛП(Константы.АдресОрганизации.Получить()) + ". " + СокрЛП(Константы.ТелефоныОрганизации.Получить());
ПоставщикРасчСчет = "";
ПоставщикБанк = "";
Кредит = "";
ПоставщикБанкБИК = "";
ПоставщикБанкКорсчет = "";
глПлатежныеРеквизиты(Объект.РасчетныйСчет, ПоставщикРасчСчет, ПоставщикБанк, Кредит, ПоставщикБанкБИК, ПоставщикБанкКорсчет);
ОблШапка1.Параметры.АдресТелефон = АдресТелефон;
ОблШапка1.Параметры.ПоставщикРасчСчет = ПоставщикРасчСчет;
ОблШапка1.Параметры.ПоставщикБанк = ПоставщикБанк;
ОблШапка1.Параметры.Кредит = Кредит;
ОблШапка1.Параметры.ПоставщикБанкБИК = ПоставщикБанкБИК;
ОблШапка1.Параметры.ПоставщикБанкКорсчет = ПоставщикБанкКорсчет;
ОблШапка1.Параметры.Контрагент = СокрЛП(Объект.Контрагент.ПолнНаименование);
ОблШапка1.Параметры.НомерДок = Объект.Номер;
ОблШапка1.Параметры.ДатаДок = Формат(Объект.Дата,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка1);
ОблШапка2.Параметры.Валюта = ?(Не Объект.Договор.Валюта.Пустая(), Объект.Договор.Валюта, "руб");
ОблШапка2.Параметры.ДатаИсполнения = Формат(Объект.ДатаИсполнения,"ДФ=dd.MM.yyyy");
ОблШапка2.Параметры.Курс = Объект.Курс;
ТабДок.Вывести(ОблШапка2);
НомерСтроки = 1;
	Для каждого ТЧ Из Объект.ТабличнаяЧасть Цикл
	ОблСтрока.Параметры.НомерСтроки = НомерСтроки;	
	ОблСтрока.Параметры.НаименованиеТовара = СокрЛП(ТЧ.МПЗ.Наименование);
	ОблСтрока.Параметры.ЕдиницаИзмерения = СокрЛП(ТЧ.ЕдиницаИзмерения.Наименование);
	ОблСтрока.Параметры.Количество = Формат(ТЧ.Количество,"ЧЦ=14; ЧДЦ=3; ЧРД=.");
	ОблСтрока.Параметры.Цена = Формат(ТЧ.Цена,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧРГ=,");	
	ОблСтрока.Параметры.Сумма = Формат(ТЧ.Сумма,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧРГ=,");	
	ТабДок.Вывести(ОблСтрока);
	НомерСтроки = НомерСтроки + 1;
	КонецЦикла; 
ОблИтогоСумма.Параметры.ИтогоСумма = Формат(Объект.ТабличнаяЧасть.Итог("Сумма"),"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧРГ=,");
ТабДок.Вывести(ОблИтогоСумма);
ОблИтогоНДС.Параметры.ИтогоНДС = Формат(Объект.ТабличнаяЧасть.Итог("НДС"),"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧРГ=,");
ТабДок.Вывести(ОблИтогоНДС);
ОблИтогоВсего.Параметры.ИтогоВсего = Формат(Объект.ТабличнаяЧасть.Итог("Всего"),"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧРГ=,");
ТабДок.Вывести(ОблИтогоВсего);
ОблПодвал.Параметры.ИтогоВсегоПрописью = ЧислоПрописью(Объект.ТабличнаяЧасть.Итог("Всего"), "Л=ru_RU;ДП=Истина", "рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2");
ОблПодвал.Параметры.Дополнение = Объект.Дополнение;
ТабДок.Вывести(ОблПодвал);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЗаявки(Команда)
	Если ЭтаФорма.Модифицированность Тогда	
	Сообщить("Для печати документ необходимо перепровести.");
	Возврат;		
	КонецЕсли;
ТабДок = Новый ТабличныйДокумент;

ПечатьЗаявкиНаСервере(ТабДок);
ТабДок.Показать("Печать заявки");
КонецПроцедуры

&НаСервере
Процедура ПечатьСчётаНаСервере(ТабДок)
Макет = Документы.ЗаявкаОтПокупателя.ПолучитьМакет("Счёт");
ОблШапка = Макет.ПолучитьОбласть("Шапка");	
ОблСтрока = Макет.ПолучитьОбласть("Строка");
ОблИтогоСумма = Макет.ПолучитьОбласть("ИтогоСумма");
ОблИтогоНДС = Макет.ПолучитьОбласть("ИтогоНДС");
ОблИтогоНП = Макет.ПолучитьОбласть("ИтогоНП");
ОблИтогоВсего = Макет.ПолучитьОбласть("ИтогоВсего");
ОблПодвал = Макет.ПолучитьОбласть("Подвал");
ОблШапка.Параметры.НазваниеОрганизации = Константы.НазваниеОрганизации.Получить();
ОблШапка.Параметры.АдресТелефон = СокрЛП(Константы.АдресОрганизации.Получить()) + ". " + СокрЛП(Константы.ТелефоныОрганизации.Получить());
ОблШапка.Параметры.ПоставщикИНН = Лев(Константы.ИННОрганизации.Получить(),Найти(Константы.ИННОрганизации.Получить(),"/")-1);
ОблШапка.Параметры.ПоставщикКПП = Сред(Константы.ИННОрганизации.Получить(),Найти(Константы.ИННОрганизации.Получить(),"/")+1); 
ОблШапка.Параметры.КодОКПО = Константы.КодОКПО.Получить();
ПоставщикРасчСчет = "";
ПоставщикБанк = "";
Кредит = "";
ПоставщикБанкБИК = "";
ПоставщикБанкКорсчет = "";
глПлатежныеРеквизиты(Объект.РасчетныйСчет, ПоставщикРасчСчет, ПоставщикБанк, Кредит, ПоставщикБанкБИК, ПоставщикБанкКорсчет);
АдресТелефонПлательщика = "";
глДобавитьРеквизит(АдресТелефонПлательщика, "Юридический адрес: ", Объект.Контрагент.ЮридическийАдрес);
глДобавитьРеквизит(АдресТелефонПлательщика, ", тел.: ", Объект.Контрагент.Телефоны);
ОблШапка.Параметры.ПоставщикРасчСчет = ПоставщикРасчСчет;
ОблШапка.Параметры.ПоставщикБанк = ПоставщикБанк;
ОблШапка.Параметры.Кредит = Кредит;
ОблШапка.Параметры.ПоставщикБанкБИК = ПоставщикБанкБИК;
ОблШапка.Параметры.ПоставщикБанкКорсчет = ПоставщикБанкКорсчет;
ОблШапка.Параметры.Плательщик = СокрЛП(Объект.Контрагент.ПолнНаименование)+", ИНН "+Объект.Контрагент.ИНН+", КПП "+Объект.Контрагент.КПП;
ОблШапка.Параметры.АдресТелефонПлательщика = АдресТелефонПлательщика;
ОблШапка.Параметры.НомерДок = Объект.Номер;
ОблШапка.Параметры.ДатаДок = Формат(Объект.Дата,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.Курс = Объект.Курс;
ТабДок.Вывести(ОблШапка);
НомерСтроки = 1;
	Для каждого ТЧ Из Объект.ТабличнаяЧасть Цикл
	ОблСтрока.Параметры.НомерСтроки = НомерСтроки;	
	ОблСтрока.Параметры.НаименованиеТовара = СокрЛП(ТЧ.МПЗ.Наименование);
	ОблСтрока.Параметры.ЕдиницаИзмерения = СокрЛП(ТЧ.ЕдиницаИзмерения.Наименование);
	ОблСтрока.Параметры.Количество = Формат(ТЧ.Количество,"ЧЦ=14; ЧДЦ=3; ЧРД=.");
	ОблСтрока.Параметры.Цена = Формат(ТЧ.Цена,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧРГ=,");	
	ОблСтрока.Параметры.Сумма = Формат(ТЧ.Сумма,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧРГ=,");	
	ТабДок.Вывести(ОблСтрока);
	НомерСтроки = НомерСтроки + 1;
	КонецЦикла; 
ОблИтогоСумма.Параметры.ИтогоСумма = Формат(Объект.ТабличнаяЧасть.Итог("Сумма"),"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧРГ=,");
ТабДок.Вывести(ОблИтогоСумма);
ОблИтогоНДС.Параметры.ИтогоНДС = Формат(Объект.ТабличнаяЧасть.Итог("НДС"),"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧРГ=,");
ТабДок.Вывести(ОблИтогоНДС);
ОблИтогоВсего.Параметры.ИтогоВсего = Формат(Объект.ТабличнаяЧасть.Итог("Всего"),"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧРГ=,");
ТабДок.Вывести(ОблИтогоВсего);
ОблПодвал.Параметры.ИтогоВсегоПрописью = ЧислоПрописью(Объект.ТабличнаяЧасть.Итог("Всего"), "Л=ru_RU;ДП=Истина", "рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2");
ОблПодвал.Параметры.Руководитель = ОбщийМодульВызовСервера.ПолучитьСотрудникаПоДолжности("Директор завода");
ОблПодвал.Параметры.ГлБухгалтер = ОбщийМодульВызовСервера.ПолучитьСотрудникаПоДолжности("Главный бухгалтер");
ТабДок.Вывести(ОблПодвал);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСчёта(Команда)
	Если ЭтаФорма.Модифицированность Тогда	
	Сообщить("Для печати документ необходимо перепровести.");
	Возврат;		
	КонецЕсли;
ТабДок = Новый ТабличныйДокумент;

ПечатьСчётаНаСервере(ТабДок);
ТабДок.Показать("Печать счёта");
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьВидМПЗПриИзменении(Элемент)
Элементы.ТабличнаяЧасть.ТекущиеДанные.МПЗ = Неопределено;
Элементы.ТабличнаяЧасть.ТекущиеДанные.Количество = 0;
Элементы.ТабличнаяЧасть.ТекущиеДанные.ЕдиницаИзмерения = Неопределено;
Элементы.ТабличнаяЧасть.ТекущиеДанные.Цена = 0;
Элементы.ТабличнаяЧасть.ТекущиеДанные.Сумма = 0;
Элементы.ТабличнаяЧасть.ТекущиеДанные.НДС = 0;
Элементы.ТабличнаяЧасть.ТекущиеДанные.Всего = 0;
КонецПроцедуры

&НаСервере
Процедура ТабличнаяЧастьКоличествоПриИзмененииНаСервере(Стр)
ТЧ = Объект.ТабличнаяЧасть.НайтиПоИдентификатору(Стр);
ТЧ.Сумма = ТЧ.Цена*ТЧ.Количество;
ТЧ.СтавкаНДС = Константы.ОсновнаяСтавкаНДС.Получить();
ТЧ.НДС = ТЧ.Сумма*ТЧ.СтавкаНДС.Ставка/100;
ТЧ.Всего = ТЧ.Сумма + ТЧ.НДС;
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьКоличествоПриИзменении(Элемент)
ТабличнаяЧастьКоличествоПриИзмененииНаСервере(Элементы.ТабличнаяЧасть.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ТабличнаяЧастьЕдиницаИзмеренияПриИзмененииНаСервере(Стр)
ТЧ = Объект.ТабличнаяЧасть.НайтиПоИдентификатору(Стр);
Цены = РегистрыСведений.Цены.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("МПЗ",ТЧ.МПЗ));
ТЧ.Цена = Цены.Цена*ТЧ.ЕдиницаИзмерения.Коэффициент*Объект.Коэфф;
ТЧ.Сумма = ТЧ.Цена*ТЧ.Количество;
ТЧ.СтавкаНДС = Константы.ОсновнаяСтавкаНДС.Получить();
ТЧ.НДС = ТЧ.Сумма*ТЧ.СтавкаНДС.Ставка/100;
ТЧ.Всего = ТЧ.Сумма + ТЧ.НДС;
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьЕдиницаИзмеренияПриИзменении(Элемент)
ТабличнаяЧастьЕдиницаИзмеренияПриИзмененииНаСервере(Элементы.ТабличнаяЧасть.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ТабличнаяЧастьЦенаПриИзмененииНаСервере(Стр)
ТЧ = Объект.ТабличнаяЧасть.НайтиПоИдентификатору(Стр);
ТЧ.Сумма = ТЧ.Цена*ТЧ.Количество*Объект.Коэфф;
ТЧ.СтавкаНДС = Константы.ОсновнаяСтавкаНДС.Получить();
ТЧ.НДС = ТЧ.Сумма*ТЧ.СтавкаНДС.Ставка/100;
ТЧ.Всего = ТЧ.Сумма + ТЧ.НДС;
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьЦенаПриИзменении(Элемент)
ТабличнаяЧастьЦенаПриИзмененииНаСервере(Элементы.ТабличнаяЧасть.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ТабличнаяЧастьСуммаПриИзмененииНаСервере(Стр)
ТЧ = Объект.ТабличнаяЧасть.НайтиПоИдентификатору(Стр);
ТЧ.Цена = ТЧ.Сумма/ТЧ.Количество;
ТЧ.СтавкаНДС = Константы.ОсновнаяСтавкаНДС.Получить();
ТЧ.НДС = ТЧ.Сумма*ТЧ.СтавкаНДС.Ставка/100;
ТЧ.Всего = ТЧ.Сумма + ТЧ.НДС;
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьСуммаПриИзменении(Элемент)
ТабличнаяЧастьСуммаПриИзмененииНаСервере(Элементы.ТабличнаяЧасть.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
ДоговорПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
Объект.Курс = ОбщийМодульВызовСервера.КурсДляВалюты(Объект.Договор.Валюта,Объект.Дата);	
Элементы.ТабличнаяЧастьСтавкаНДС.Видимость = Не Объект.Договор.БезНДС;
Элементы.ТабличнаяЧастьНДС.Видимость = Не Объект.Договор.БезНДС;
ПересчётТабличнойЧасти();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Элементы.ТабличнаяЧастьСтавкаНДС.Видимость = Не Объект.Договор.БезНДС;
Элементы.ТабличнаяЧастьНДС.Видимость = Не Объект.Договор.БезНДС;
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьСтавкаНДСПриИзменении(Элемент)
ТабличнаяЧастьСтавкаНДСПриИзмененииНаСервере(Элементы.ТабличнаяЧасть.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ТабличнаяЧастьСтавкаНДСПриИзмененииНаСервере(Стр)
ТЧ = Объект.ТабличнаяЧасть.НайтиПоИдентификатору(Стр);
	Если Не Объект.Договор.БезНДС Тогда
	ТЧ.НДС = ТЧ.Сумма*ТЧ.СтавкаНДС.Ставка/100;
	КонецЕсли;
ТЧ.Всего = ТЧ.Сумма + ТЧ.НДС;
КонецПроцедуры

&НаСервере
Процедура ПересчётТабличнойЧасти()
	Для каждого ТЧ Из Объект.ТабличнаяЧасть Цикл
	ТЧ.Сумма = ТЧ.Цена*ТЧ.Количество;	
		Если Объект.Договор.БезНДС Тогда
		ТЧ.СтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка();
		ТЧ.НДС = 0;
		ТЧ.Всего = ТЧ.Сумма;
		Иначе
		ТЧ.СтавкаНДС = Константы.ОсновнаяСтавкаНДС.Получить();
		ТЧ.НДС = ТЧ.Сумма*ТЧ.СтавкаНДС.Ставка/100;
		ТЧ.Всего = ТЧ.Сумма + ТЧ.НДС;		
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура БезНДСПриИзменении(Элемент)
Элементы.ТабличнаяЧастьСтавкаНДС.Видимость = Не Объект.Договор.БезНДС;
Элементы.ТабличнаяЧастьНДС.Видимость = Не Объект.Договор.БезНДС;
ПересчётТабличнойЧасти();
КонецПроцедуры

&НаКлиенте
Процедура КоэффПриИзменении(Элемент)
КоэффПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КоэффПриИзмененииНаСервере()
	Для каждого ТЧ Из Объект.ТабличнаяЧасть Цикл
	Цены = РегистрыСведений.Цены.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("МПЗ",ТЧ.МПЗ));
	ТЧ.Цена = Цены.Цена*ТЧ.ЕдиницаИзмерения.Коэффициент*Объект.Коэфф;
	КонецЦикла;
ПересчётТабличнойЧасти();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
Объект.Договор = Объект.Контрагент.ОсновнойДоговор;
ДоговорПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКоэффициент(Команда)
	Если Вопрос("Вы действительно хотите изменить коэффициент?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
	ВыбКоэффициент = Объект.Коэфф;
		Если ВвестиЧисло(ВыбКоэффициент,"Введите новый коэффициент?",4,2) Тогда
		Объект.Коэфф = ВыбКоэффициент;
		КоэффПриИзмененииНаСервере();
		КонецЕсли; 	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДвижения(Команда)
ИмяОтчета = "ОтчётПоРегиструЗаявкиОтПокупателей";
ПараметрыФормы = Новый Структура;
ПараметрыФормы.Вставить("СформироватьПриОткрытии",Истина);
ПараметрыФормы.Вставить("ПользовательскиеНастройки",ОбщийМодульВызовСервера.ЗаполнитьПользовательскиеНастройкиОтчетаСКД(ИмяОтчета,Объект.Дата,ТекущаяДата(),Новый Структура("ЗаявкаОтПокупателя",Объект.Ссылка),"ПоЗаявкам"));
ПараметрыФормы.Вставить("КлючВарианта","ПоЗаявкам"); 
ОткрытьФорму("Отчет." + ИмяОтчета + ".Форма", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
//Отказ = Не ЭтаФорма.ПроверитьЗаполнение();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьМТК(Команда)
ОткрытьФорму("Документ.ЗаявкаОтПокупателя.Форма.СозданиеМТК",Новый Структура("Документ",Объект.Ссылка));
КонецПроцедуры

&НаСервере
Процедура РассчитатьДляСЦНаСервере()
	Для каждого ТЧ Из Объект.ТабличнаяЧасть Цикл	
		Если ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты Тогда
		ТЧ.Цена = ОбщийМодульВызовСервера.ПолучитьСтоимостьМПЗ(ТЧ.МПЗ,1,Объект.Дата,0)*2;
		ТЧ.Сумма = ТЧ.Цена*ТЧ.Количество;
		ТЧ.СтавкаНДС = Константы.ОсновнаяСтавкаНДС.Получить();
		ТЧ.НДС = ТЧ.Сумма*ТЧ.СтавкаНДС.Ставка/100;
		ТЧ.Всего = ТЧ.Сумма + ТЧ.НДС;
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьДляСЦ(Команда)
РассчитатьДляСЦНаСервере();
КонецПроцедуры

&НаСервере
Функция ПечатьЭтикеткиНаСервере(МПЗ)
ТабДок = Новый ТабличныйДокумент;

Макет = ПолучитьОбщийМакет("ЭтикеткаНаУпаковку_ПФ_101х57Р");
ОблЭтикетка = Макет.ПолучитьОбласть("Этикетка");
ОблЭтикетка.Параметры.Наимен = СокрЛП(МПЗ.Наименование);
ОблЭтикетка.Параметры.Документ = "Заявка от покупателя "+Объект.Номер;
ОблЭтикетка.Параметры.Контрагент = СокрЛП(Объект.Контрагент.Наименование);
ОблЭтикетка.Параметры.Автор = СокрЛП(Объект.Автор.Наименование);
ОблЭтикетка.Параметры.ДатаВывода = ТекущаяДата();
ТабДок.Вывести(ОблЭтикетка);  
ТабДок.РазмерСтраницы = "Custom";
ТабДок.ВысотаСтраницы = 101;
ТабДок.ШиринаСтраницы = 57;
ТабДок.ПолеСлева = 0;
ТабДок.ПолеСверху = 0;
ТабДок.ПолеСнизу = 0;
ТабДок.ПолеСправа = 0;
ТабДок.РазмерКолонтитулаСверху = 0;
ТабДок.РазмерКолонтитулаСнизу = 0;
Возврат(ТабДок);
КонецФункции

&НаКлиенте
Процедура ПечатьЭтикетки(Команда)
	Если Элементы.ТабличнаяЧасть.ТекущаяСтрока <> Неопределено Тогда
	ТД = ПечатьЭтикеткиНаСервере(Элементы.ТабличнаяЧасть.ТекущиеДанные.МПЗ);
	ТД.Показать("Этикетка");
	Иначе
	Сообщить("Выберите строку документа!");
	КонецЕсли; 
КонецПроцедуры
